# IsInEditMode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..IsInEditMode Method
Stairs Class See Also
---
Indicates whether the stairs is in edit mode or not.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsInEditMode()
```

Visual Basic
---
```text
Public Function IsInEditMode As Boolean
```

Visual C++
---
```text
public:
bool IsInEditMode()
```

# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace